## Production: fable-test
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| add    | `aws_amplify_app.design_system_fable_test_app` |
|        | `aws_amplify_branch.main_fable_test`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_amplify_app.design_system_fable_test_app will be created
  + resource "aws_amplify_app" "design_system_fable_test_app" {
      + access_token      = (sensitive value)
      + arn               = (known after apply)
      + build_spec        = <<-EOT
            version: 1
            applications:
              - frontend:
                  phases:
                    preBuild:
                      commands:
                        - npm ci --cache .npm --prefer-offline
                    build:
                      commands:
                        - npm run build
                  artifacts:
                    baseDirectory: dist
                    files:
                      - '**/*'
                  cache:
                    paths:
                      - .npm/**/*
                appRoot: fable-test-app
        EOT
      + custom_headers    = (known after apply)
      + default_domain    = (known after apply)
      + id                = (known after apply)
      + name              = "GCDS Canadian Holidays"
      + platform          = "WEB"
      + production_branch = (known after apply)
      + repository        = "https://github.com/cds-snc/gcds-examples"
      + tags_all          = (known after apply)

      + custom_rule {
          + source = "/<*>"
          + status = "404"
          + target = "/404"
        }
    }

  # aws_amplify_branch.main_fable_test will be created
  + resource "aws_amplify_branch" "main_fable_test" {
      + app_id                      = (known after apply)
      + arn                         = (known after apply)
      + associated_resources        = (known after apply)
      + branch_name                 = "main"
      + custom_domains              = (known after apply)
      + destination_branch          = (known after apply)
      + display_name                = "production"
      + enable_auto_build           = true
      + enable_pull_request_preview = true
      + id                          = (known after apply)
      + source_branch               = (known after apply)
      + stage                       = "PRODUCTION"
      + tags_all                    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_fable_test_app"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_fable_test"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
